{
	"posts": [
		{
			"ID": "1",
			"title": "A First Impression",
			"date": "Sun. 28 September 2014",
			"headline": "An introduction to .Write, my work, and myself.",
			"content": "Hi, I'm John Wickham. I'm a high school junior from Charlotte, North Carolina. I'm starting this blog because I feel there's something special about me; I'm extremely passionate about designing and building beautiful and intuitive mobile apps and websites. And I want to share my ideas and experiences with the world as I grow my professional self.<br><br>Everyone has their 'thing' &mdash; it's that part of us that we identify with, that motivates us. An interest, a hobby &mdash; whatever it is that we're passionate about. My 'thing' is software, and it has been as long as I can remember. As long as I've had contact with computers, electronics, machines, I've had an instinct to break them down, see how they work, what they do &ndash; and how we can make them better. For me, that's what software is all about; finding new ways that technology can improve on the things we do every day.<br><br>So how does software design improve anything? Is technology really at a point where any kid with a MacBook can change the world with a few keystrokes? <b>No.<\/b> I'll say it again, <b>no.<\/b> Technology on its own is profoundly powerful &ndash; never before have we been able to <a href=\"https:\/\/www.apple.com\/ios\/facetime\/\">speak face to face from across the globe.<\/a> But power isn't enough to make a change. It's a double&ndash;edged sword; technology's power brings with it a nature of complexity and confusion. For technology to be an impactful part of our lives, we need a way to harness its immense power without requiring such immense energy on our part. Simply put, we need something to make technology <i>intuitive<\/i>.<br><br>We call this something <b>design.<\/b> At risk of sounding pretentious, design is an art. It's an art that makes the power of technology work for us, not against us. It acts as a bridge between the complexity of technology and the simplicity we crave as humans. This simplicity is known as <i>intuition<\/i>. Intuition is understanding without trying to understand &mdash; innate simplicity. When something is designed right, we're able to use it for whatever purpose it serves, and we never have to think about the act of using it. We don't have to think about writing with a pen; it was designed in such a way that we can focus on what we're writing, without thinking about how to write or what it feels like to write.<br><br>This is my philosophy; form and function. Powerful technology and intuitive design means the best experience. I believe this combination is what drives innovation, propelling us forward into a future where anything is possible. It's my mission to get us there."
		},
		{
			"ID": "2",
			"title": "A Year of Mixtape",
			"date": "Tues. 30 September 2014",
			"tags": "iOS",
			"headline": "Looking back on a whole year of developing Mixtape",
			"content": "Three&ndash;hundred and sixty&ndash;five days ago today, I had a problem. I was car&ndash;pooling with a good friend of mine, <a href=\"https:\/\/twitter.com\/coletonBryan\">Coleton Bryan<\/a>, trying to find a good way to put together a playlist for the road. How did such a simple need turn into a year&ndash;long project? We've advanced faster than our means of music&ndash;sharing.<br><br>Ten years ago (that's 2004, not 1994), there was one way to do it; burn a CD. Thirty years ago, just use a cassette. Now, we've evolved past any physical embodiment of our music &mdash; an iTunes gift card is the closest we can get to holding music in our hands. But as we've left physical media in the past, we've neglected to modernize our means of sharing the music we so love. Even emailing music files has become too much of a hassle (not to mention its questionable legality).<br><br>So, this is <a href=\"http:\/\/mixtape.wjwickham.com\/\">Mixtape<\/a>; it's the new way to share the music you love with the people that matter. All you need is a friend and an iPhone, and you're on your way to creating collaborative playlists. An awesomely simple idea that became the most in&ndash;depth project I've undertaken to date. This project meant several new challenges for me, the biggest of which was getting my feet wet in the world of server transactions.<br><br>Until this point, my projects involved handling data that was local &mdash; actually on the user's device. <a href=\"http:\/\/wjwickham.com\/Apps\/Subjects_3.html\">Subjects<\/a>, an early productivity app of mine, allowed for notes and checklist tasks to be stored in the app. This data never went anywhere; the user created it, saved it, and accessed it as needed. But the whole idea of Mixtape is to share; data can't stay put anymore. This prompted a learning period; PHP for server&ndash;end scripting, JSON for data packaging, the <a href=\"http:\/\/afnetworking.com\">AFNetworking<\/a> library for transactions on iOS&hellip;.<br><br>The summer of 2014 was one of unprecedented learning (I was also implementing new iOS 8 APIs, not to mention I'm also a web developer). At the time of writing this, Mixtape is awaiting approval from Apple to be made available on the App Store (after an altercation of sorts with App Review). It was my longest, toughest, and most daunting project to date. And it's also my favorite. Something tells me when people finally get to use this app, all my time will have paid off."
		},
		{
			"ID": "3",
			"title": "20 Years of the Web",
			"date": "Wed. 15 October 2014",
			"tags": "WEB DESIGN",
			"headline": "Thoughts about the state of the Web on the 20th birthday of browsers",
			"content": "I've always had a love\/hate relationship with the Web. If you haven't realized, the Web is daunting. No matter how much of an avid surfer you are, you'll never be able to see 1% of the information that's out there online &mdash; there's content out there for everyone, and people are constantly finding new ways to leverage it in awesomely creative ways. Clearly, this is a really powerful tool (that's the love), and it deserves all the hype that it's amassed over the last 20 years. But the Web isn't reaching its full potential (here's the hate). It's limited by archaic details &mdash; unwritten yet outdated design conventions, ambiguous technical standards, and design driven by static information rather than dynamic interaction.<br><br><b>BACK BY POPULAR DESIGN<\/b><br>The term <i>design convention<\/i> refers to the common patterns of design that are found across the Web. For example, we typically see the logo of a site in the upper left corner, and we expect this to be a link to the home page (well would you look at that). Users of all different sites come to know this behavior and expect it to be similar to matter where they are on the Web. But many of the Web's popular design conventions are incredibly counterintuitive. Rollover menus, to name one, disrupt the whole navigation hierarchy. These menus hide navigation elements that users need to see &mdash; otherwise, they don't know where they are, or where they can go! Not to mention this nightmare: <img style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; -webkit-border-radius: 5px; border: 1px solid rgba(0,0,0,0.10);\" src=\"http:\/\/www.xenon-webdesign.co.uk\/dev\/wp-contents\/uploads\/2013\/03\/amazon-fast-navigation-2.gif\"\/><span class=\"caption\">What a nightmare&hellip;<\/span><br><b>MULTILINGUAL<\/b><br>For those unfamiliar, webpages are created with a combination of files written in different code languages. Namely, HTML, CSS, JavaScript, jQuery, PHP&hellip; that's a lot to handle! To create intuitive and useful webpages, you need to know not one or two, but <i>several<\/i> different languages. This is fairly understandable 20 years ago when this technology was fairly new and unfamiliar, but we've come so far &mdash; a single, even just two, languages to streamline the process could enable so many more designers to realize their full potential! Thank God for <a href=\"http:\/\/jquery.com\/\">jQuery<\/a> I guess&hellip;<br><br>Then, there's an issue of data management. In order to save data that users submit to your site, you'll need the HTML and CSS that lay out the page, a database (SQLite or the likes), some JavaScript or jQuery, the PHP that handles transactions&hellip; and it all needs to be secure and responsive.<br><br><b>EVER CHANGING, NEVER CHANGING<\/b><br>Within the last handful of years, there's been a lot of talk among designers about <i>responsive design<\/i> &mdash; that's designing your webpages to respond to users' interactions. When your design is responsive, it makes a huge difference for the user experience! They feel more engaged, more aware, and ultimately more in control. The response of elements to a user's interaction helps the user understand what they're doing, where they are in your navigation hierarchy, and what their actions will do on the page. 20 years ago, this was less of a concern. Early webpage designs were strictly for presenting static content &mdash; information that didn't change based on what the user was doing. This set a poor precedent that still plagues many webpages we use today. The Web evolved quickly; websites were now becoming tools, rather than just sources of information, yet design has failed to evolve with the ever changing ways we leverage technology."
		},
		{
			"ID": "4",
			"title": "The Magic of Standing Out",
			"date": "Sat. 18 October 2014",
			"headline": "How do you stand out in a crowd that stands out?",
			"content": "The world loves to drool over Silicon Valley companies. The culture that surrounds the enigmatic inner circle of cutting&ndash;edge creators is dazzling to anyone on the outside, and that sense of wonder has made the products that come out of Silicon Valley stand out from any that existed before them. As I begin to form my professional identity, I've learned that \"I made an app\" is much less impressive to other developers (and potential employers) than it is to anyone off the street. So how does one make themselves unique in a world where being different is the mainstream?<br><br>Everyone knows the name Daniel Radcliffe &mdash; that's Harry Potter, 'the boy who lived.' But I'm willing to bet you're unfamiliar with the name Alex Argenti. Argenti played the role of a wizard in Harry Potter who the audience never meets; she just goes about her fictional business in the background. This is not to say her character is just any old person, or 'muggle' &mdash; she's a wizard for crying out loud! Why, then, does she have no part in the story? Think of it like this: a wizard among muggles is like a rose among thorns. By comparison, it's unique, interesting, and favorable. But a wizard at a wizard school is just a rose among&hellip; roses. It's no less interesting or desirable, but it's not more so than others around it! The story focuses only on Harry Potter because he is supposedly special, more interesting than the other wizards.<br><br>\"Gotcha, so Harry Potter is a Silicon Valley legend.\" The point is, with so much similar talent in the development and design field, I need to make myself stand out if I'm going to make a significant impact. That's why it encourages me to hear people say I'm \"the next Steve Jobs.\" Not because I'm going to be famous or rich, but because being compared to Jobs means I exhibit some quality &mdash; whether it's my passion, intelligence, vision &mdash; that gives me the potential to stand out. (Don't get me wrong, I'd much rather be compared to <a href=\"http:\/\/www.apple.com\/pr\/bios\/jonathan-ive.html\">Jony Ive<\/a>, but more on that later&hellip;)"
		},
		{
			"ID": "5",
			"title": "\"Innovative Junior Brings Fresh Talent to the App Store\"",
			"date": "Mon. 9 February 2015",
			"tags": "FEATURES",
			"headline": "From the Providence High School newspaper",
			"content": "<br><a href=\"http:\/\/www.providenceprowl.org\/2015\/02\/09\/innovative-junior-brings-fresh-talent-to-the-app-store\">An article by Emma Hankins from the Providence High School newspaper:<\/a><br><br>&quot;There’s an app for that.&quot; The now-famous advertising slogan illustrates the ubiquity of apps, short for &quot;application software,&quot; in modern life. But who creates this technology? Ask someone to imagine an app developer and they will probably picture a twenty-something in a modern, Google-esque computer lab tapping away at a fancy tablet. The reality, however, may look a little more familiar: John Wickham, a junior at Providence, scribbling away in a notebook. Wickham has been developing apps since he received his first iPod in the fifth grade. Even before that, he recalls tinkering with and fixing household appliances, such as a broken DVD player.<br><br>&quot;I love to take things apart and see how they work, and specifically see how I could make them better,&quot; says Wickham. &quot;At a time when apps and websites are all everywhere, [they] became the way that I do that.&quot;<br><br>But before he could begin tinkering with new technology, Wickham had to learn the language of software: code. &quot;I would say that I speak four or five different languages [of code],&quot; says Wickham. &quot;You can just write code with pencil and paper if it came down to it, but just in the last four or five years even, they’ll arrange code neatly and highlight different programs and color code, so it’s kind of interesting to see how software is being built that helps you build software.&quot; Apple encourages independent developers like Wickham with its own software development kit that can be used to build unique code. &quot;Once you know the language, you become an enrolled developer and you get a trust store certificate, which is basically a certificate that verifies your identity as a developer who can run software on an iPhone,&quot; says Wickham.<br><br>Once he has the tools to make an app, all it takes is an idea, Wickham says. &quot;I start by writing down the idea or the problem, and ultimately what is my goal. From there, it kind of goes down a list of what features it should have, what it should do. From there, I design the way it works, the way you interact with it.&quot;<br><br>Wickham is not the only one coming up with ideas for apps or websites. &quot;In the past I’ve had people come to me and say, ‘I have this idea and I just don’t know what would be best; I don’t know if it should be a website or an app,’&quot; Wickham says. &quot;So sometimes I spend some time researching the problem they have and other people who have it and talk to some people.&quot;<br><br>Two of Wickham’s apps, which are currently available on the Apple App Store, came from simply identifying a problem and searching for a solution. &quot;[A friend and I] were trying to share music,&quot; Wickham says, &quot;and we realized that you just can’t do that. You can send a photo or you can send a link, but there’s no way to send songs.&quot; So, Wickham created an app called Mixtape that allows friends to collaborate on playlists on their phones.<br><br>Another friend came to Wickham with a problem. &quot;[He] came to me and said that DJs need a way to slow down music and change the pitch and iPhones can’t do that,&quot; Wickham says. &quot;So I spent some time talking to other people who do kind of the same thing and asked what are some features that they would want to see out of it.&quot; A month later, Wickham had created an app called PitchFork that allows users to easily change the speed and pitch of any song in their music library.<br><br>After any developer builds an app for an Apple operating system, he or she must send it to Apple to be reviewed before it can be sold. Wickham says the review process is quite intensive. &quot;They made that product, and they feel like people who use iPhone and iPad should really get the best experience, so they spend usually about 12 days with your app to make sure that people who use it are going to get something out of it,&quot; Wickham says.<br><br>Wickham now has a small business run from his website, wjwickham.com, where prospective clients with ideas for apps or websites can browse his portfolio. &quot;For doing website contracting it’s an especially great deal because money goes directly from their account to mine, so I miss out on taxes, because technically it’s not registered as income yet,&quot; Wickham says. When he sells his apps in the App Store, Apple takes 35% per unit and Wickham keeps the rest. So far, Wickham’s apps are only available on Apple products. On the Apple-Android debate, Wickham says, &quot;I can’t speak to that same level of intimacy [that I have with Apple development] with Android development.&quot; Wickham also admires the design and ideas behind Apple products. He even considers Jony Ive, Apple’s product designer, his hero.<br><br>Though many people may think of developing apps as a highly technical job with little social interaction, for Wickham it is about helping people. &quot;I strive to make every pixel and every motion, every word, every letter, count toward my ultimate goal [for the app],&quot; Wickham says. &quot;I think the thing that I enjoy most is seeing those little tiny details become something much, much bigger and I think part of that is seeing the impact that it has on the people that use it.&quot; While Wickham says he would love to make a career out of app development, he says that technology changes so rapidly that he has to be ready for whatever the next big thing is. &quot;As far as the future of technology itself,&quot; Wickham says, &quot;I think we are going to start seeing a lot less desktop computers and a lot more of things that move with us. It’s beyond me at this point, but all I can say is I hope I’m the one that creates it.&quot;"
		},
		{
			"ID": "6",
			"title": "Introducing Prototask",
			"date": "Wed. 28 January 2015",
			"tags": "PROTOTASK, iOS",
			"headline": "And the decision to discontinue Subjects",
			"content": "In my eighth&ndash;grade year, some part of me had the idea for a five&ndash;in&ndash;one multitasking productivity app, Subjects. Included was a <i>very<\/i> light checklist feature, web browser, freehand drawing canvas, notebook, and calculator. Try to ignore, for a minute, the obvious usablilty implications that come with an app so packed with unrelated functionality, because, at the time, this was my greatest accomplishment: my first product in the App Store. Eighth&ndash;grade me was thrilled, and blissfully ignorant to the egregious mistakes in design and performance of Subjects.<br><br>Fast forward two years: Subjects 3 is on sale, and in spite of its dramatically improved design, the core concept was still&hellip; utterly unusable. I learned a <i>ton<\/i> working on Subjects in those two years (iOS's modal&ndash;view pattern, the delegate pattern, <code>UIKit<\/code>, Interface Builder and Xcode, <code>NSUserDefaults<\/code>), and all of that learning is invaluable. That learning went into new projects (Element X, Mixtape, PitchFork) and left Subjects on the backburner. Now, I'm returning to the Subjects project with everything I've learned in other projects and relaunching an entirely new solution: Prototask.<br><br><img style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 35%;\" src=\"Contents\/7-Proto-Model.png\"\/><br><br>As sad as I am to see the demise of my very first product, Prototask is a dramatically improved experience with a focus on the strongest feature of Subjects, the tasklist capability. Prototask is beautifully designed around the simplicity and utility specific to the goals of the app. (Prototask is also my first encounter with <code>WatchKit<\/code> for Apple Watch, but more on that later) The interface is gesture&ndash;driven to keep it incredibly simple and create an engaging sense of fluidity that drives intuitive interactions. And beyond its beauty, Prototask is powerful. Unlimited lists, unlimited tasks, reminder notifications, iCloud sync&hellip; Prototask does everything you need, and it does them the best. Using it is an absolute pleasure, and it's awesome to see how far I've come since Subjects.<br><br><a href=\"http:\/\/prototask.wjwickham.com\/\">Learn more about Prototask<\/a>"
		},
		{
			"ID": "7",
			"title": "I Won a WWDC Student Scholarship",
			"date": "Mon. 11 May 2015",
			"tags": "APPLE,WWDC15,FEATURES",
			"headline": "It's an actual dream come true",
			"content": "On May 8th, one of my actual dreams came true: I won a WWDC student scholarship. Of thousands of applicants and a small percentage of winners, I was hand&ndash;picked by Apple to attend this year's conference.<br><br>For anyone unfamilar with the World Wide Developers Conference, it's a weeklong event hosted by Apple in San Francisco where thousands of developers from around the world get a chance to learn about the future of iOS and OS X from the designers and engineers at Apple. Next to product releases each fall, it's one of the few times the world hears from Apple each year, so all eyes are on the Bay Area this June. Needless to say, I'm stoked.<br><br><img style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; -webkit-border-radius: 5px; border: 1px solid rgba(0,0,0,0.10); width: 60%;\" src=\"Contents\/8-WWDC.png\"\/><span class=\"caption\">Maybe the best email I've ever receieved&hellip;<\/span><br><br>This conference is huge for me for two reasons. First, it's a sort of validation of everything I've been working toward. The years of self&ndash;teaching and frustration over things I barely understood have finally paid off, and I'm not just amateur hour anymore. This conference is also an amazing opportunity. It's fairly obvious that I aim to be a part of Apple's team in the future, so WWDC 2015 is starting to feel like my big break.<br><br>All in all, I'm extremely honored to have been chosen, and I couldn't be more excited.<br><br><a href=\"https:\/\/developer.apple.com\/wwdc\/\">Learn more about WWDC<\/a> and check .Write June 6 &ndash; 12 for updates about my time at the conference. Conference updates will be tagged with the <span style=\"background: #621fce; color: white; font-weight: 700; font-size: 15px; padding: 3px 7px 3px 7px; -webkit-border-radius: 3px; user-select: none; -webkit-user-select: none;\">WWDC15<\/span> tag."
		},
		{
			"ID": "8",
			"title": "Nobody Cares About Your Newsletter",
			"date": "Sun. 31 May 2015",
			"headline": "And other truths about empathizing with your customers",
			"content": "Something I find myself doing very frequently is unsubscibing from the newsletter of a company that I really don't care about. Usually, it's a company from which I orded one product one time and never thought about again. And I think that's reasonable; I just wanted to order this one thing, I wasn't looking for a long-term relationship with this company. It's a tough realization, but many of us need to understand: most of our customers don't really care about us day to day. We don't need to be sending them updates about our operation, which they aren't involved in at all.<br><br>\"But John,\" you'll say, \"newsletters keep customers engaged! They create a relationship with customers and bring back their business!\" There was a time about a decade ago when that may have been true, but here's where empathy becomes important; put yourself in your customers' position. Unless it truely benefits them, customers probably won't care very much. Often, newsletters are just annoying, and work against their purpose. So underneath all their imporrant email messages, your newsletter becomes the internet equivelant of telemarketing calls: <i>junk mail<\/i>. This is especially true if you took the liberty of adding a customer to your newsletter subscription list without asking them. That's just plain irritating.<br><br>There is one exception to this: sales, discounts, promotions&hellip; if the customer gets something valuable from it, they might actually care about it. Just make sure you keep it brief and to the point, and, most importantly, <b>make it really easy to unsubscribe<\/b>. If you really want to keep your customers in the loop about everything, <b>write a good looking blog instead<\/b>.<br><br>The point is, in everything you do, consider how your customers are going to think and feel and react. Be empathetic."
		},
		{
			"ID": "9",
			"title": "I'm One of Apple's '20 Under 20'",
			"date": "Mon. 1 June 2015",
			"tags": "APPLE,FEATURES",
			"headline": "PitchFork is being featured on the App Store",
			"content": "The last month has been wild. After <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#8\">winning Apple's WWDC scholarship<\/a>, I got an exciting call from Apple. I was told that the company was going to run a \"20 under 20\" promotional campaign, featuring 20 developers under 20 years old.<br><br><img style=\"display: block; margin-left: auto; margin-right: auto; width: 80%; max-width:375px; margin-top: 30px; -webkit-border-radius: 5px; border: 1px solid rgba(0,0,0,0.10);\" src=\"Contents\/10-Store.png\"\/><span class=\"caption\">PitchFork on the App Store with a new Editors' Note<\/span><br><br>As a part of the campaign, Apple is promoting <a href=\"https:\/\/itunes.apple.com\/us\/app\/pitchfork\/id918620458?mt=8\">PitchFork<\/a> on the App Store. Promoted apps appear on the main screen of the App Store on iPhones and iPads everywhere, with an accompanying explanation of why it was selected. Other 20 Under 20 developers include WWDC scholarship winners like myself who have created exceptional products. I've imagined what it's like to be featured since I started with iOS development years ago, and I'm about to actually find out!<br><br><a style=\"text-decoration: none;\" class=\"nocolor\" href=\"http:\/\/appstore.com\/20under20\"><div style=\"width: 100%; height: auto; line-height: 75px; text-decoration: none; font-weight: 500; background: #f4f5f8; -webkit-border-radius: 5px; padding-left: 30px; overflow: hidden;\">See PitchFork featured on the App Store <img src=\"\/Images\/Disclosure.png\" width=\"7\"\/><\/div><\/a><br>In all honesty, I wouldn't have expected PitchFork to win any such award. Don't get me wrong, I try to create everything with intention and care, but PitchFork is such a simple app that it almost feels like another of mine could have one simply because I spent more time on the project. I'll take all of this as a testament to simplicity and not over&ndash;thinking things too much. Sometimes <a href=\"https:\/\/www.apple.com\/support\/assets\/images\/products\/iPodclassic\/hero_ipodclassic_2009_2x.jpg\">ideas that seem so simple<\/a> end up being the very best."
		},
		{
			"ID": "10",
			"title": "WWDC: T&ndash;Minus 2",
			"date": "Thurs. 4 June 2015",
			"tags": "APPLE,WWDC15",
			"headline": "A few thoughts as WWDC approaches",
			"content": "With only two days until WWDC begins, I'm starting to feel the full weight of this opportunity and what it could mean for me. Mostly, I'm starting to perceive some unsponken competition among the student scholarship winners. It wasn't enough that we all had to compete for an invitation to Apple's developer conference, but now it feels as though we're all competing to stand out from an already distinguished crowd &mdash; and we all know <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#5\">how hard it is to do that<\/a>.<br><br>I've been thinking about some different things that coud make me stand out in the sea of young talent converging on San Francisco. I've had some <a href=\"https:\/\/twitter.com\/thejohnwickham\/status\/603632194628751360\">gorgeous business cards<\/a> printed in anticipation of the crucial networking to be done. I also created <a href=\"http:\/\/wjwickham.com\/Hello.pkpass\">an iPhone version of my business card as a PassBook pass<\/a>. iPhone users can add the pass to the PassBook app on their iPhone and carry my business card with them wherever they go.<br><br>There is one thing that I think will really shine a spotlight on me. <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#10\">Being featured by Apple<\/a> in the 20 Under 20 promotion really says a lot; of the hundreds of scholarship recipients, only 20 were featured including myself. To my, that's something that really sets me apart from the other scholarship winners, and I'm hoping others think so too."
		},
		{
			"ID": "11",
			"title": "I'm in USA TODAY",
			"date": "Sat. 6 June 2015",
			"tags": "FEATURES,APPLE,WWDC15",
			"headline": "USA TODAY has featured me in an article",
			"content": "Wrapping up my first day in San Francisco, USA TODAY published <a href=\"http:\/\/www.usatoday.com\/story\/tech\/2015\/06\/06\/next-generation-of-app-developers\/28494499\/\">a story about WWDC<\/a> and the <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#8\">scholarship students<\/a>. It's a brief article that includes some (slightly misconstrued) quotes from me (as well as a sweet last&ndash;minute iPhone picture).<br><br>Also featured in the article are two thirteen&ndash;year&ndash;old developers on scholarship, hence the <a href=\"\">feeling of unspoken competition<\/a>.<br><br><a style=\"text-decoration: none;\" class=\"nocolor\" href=\"http:\/\/www.usatoday.com\/story\/tech\/2015\/06\/06\/next-generation-of-app-developers\/28494499\/\"><div style=\"width: 100%; height: auto; line-height: 75px; text-decoration: none; font-weight: 500; background: #f4f5f8; -webkit-border-radius: 5px; padding-left: 30px; overflow: hidden;\">Read the article on USA TODAY <img src=\"\/Images\/Disclosure.png\" width=\"7\"\/><\/div><\/a><br>Although the article claims that I'm a college student, and that <a href=\"https:\/\/itunes.apple.com\/us\/app\/pitchfork\/id918620458?mt=8\">PitchFork<\/a> has &quot;become popular with DJs,&quot; I'm both honored and in a state of disbelief that there are articles being written about me. After <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#8\">winning a WWDC scholarship<\/a>, <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#10\">being featured in Apple's 20 Under 20 promotion<\/a>, and today's article, the last month has been an avalanche of recognition for everything I've been working toward. It feels great to know that people so interested in the work I'm doing, and I love that they get to see how I'm still learning, every single day. I don't ever want to be at a place where I'm no longer learning anything. I think when you find yourself in a place where you have nothing left to learn, it means you have nothing left to give. The best products come from the people who are always learning &mdash; the ones who stay hungry."
		},
		{
			"ID": "12",
			"title": "NSWaitingQueue: WWDC Day 1",
			"date": "Mon. 8 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping the first day of WWDC 2015",
			"content": "It's 55º in San Francisco, California. At 11:48 PM, I joined a queue of about 100 other developers waiting for the 10:00 AM keynote presentation that will officially start WWDC 2015. If it seems slightly crazy to you to be queueing up so early, it's just not an Apple event without an enormous line. In fact, one surprising quirk about WWDC that I've noticed is that there's a line for just about everything, and it's always a fight to the front.<br><br>For the other 4,650 developers in San Francisco, WWDC starts on Monday with the keynote. Student scholarship winners, however, spent Sunday at a special orientation (hosted at none other than the Four Seasons). The event was very much in the typical Apple style, <a href=\"http:\/\/en.wikipedia.org\/wiki\/Myriad_(typeface)#Myriad_Apple\">Myriad Pro<\/a> plastered on just about everything (with the rare appearance of San Francisco, the brand&ndash;new font designed specifically for Apple Watch).<br><br>Included at the orientation session was a brief lunch, lots of time for mingling and networking, a small keynote from some Apple executives, and even a short appearance by CEO Tim Cook. The presentation shared stories from a few executives, how they arrived at Apple, and their day&ndash;to&ndash;day work in Cupertino. The most notable concept that I gathered is that there is no one path to working at Apple. That's someting that I was excited to hear; the last ten years of public schooling have convinced me that everyone is destined to follow the same process, and it feels right that Apple wouldn't buy into that.<br><br>One final observation from my first day at the conference is the amazing diversity. Apple has invited students from all across the globe. Today I got to connect with people from Germany, Singapore, Korea, India, the UK, Colombia, Sweeden&hellip;. There is a ton of talent here, undoubtably some of the brightest minds out there. It's easy to get swept up in the exitement, but when I look around and meet new people, I feel incredibly honored to be here.<br><br>Of course, check .Write every day for updates about the conference, tagged with the <span style=\"background: #621fce; color: white; font-weight: 700; font-size: 15px; padding: 3px 7px 3px 7px; -webkit-border-radius: 3px; user-select: none; -webkit-user-select: none;\">WWDC15<\/span> tag."
		},
		{
			"ID": "13",
			"title": "I'm an Imposter: WWDC Day 2",
			"date": "Mon. 8 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping day two of WWDC 2015",
			"content": "I'm a total imposter. Not really, it just feels that way. 5,000 of the worlds brightest minds in design and development are here, and I'm beginning to recognize where I stand in terms of technical proficiency. In the shadow of these awesomly talented people, I'm beginning to feel a little bit like I don't belong; like I'm an imposter. It stems a little bit from the <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#11\">unspoken competition<\/a> I was feeling just before the conference. In person, it's become full&ndash;fledged, passive&ndash;aggressive battle to take the spotlight.<br><br>In anticipation of the keynote presentation that unveils new software and officially begins the conference, I took my place in line at 11:45 PM, about ten hours before the presentation started. I stood in that line with some perfect strangers, who ended up becoming <a href=\"https:\/\/twitter.com\/fga\">great friends<\/a>. I made a brief cameo in Apple's <a href=\"http:\/\/apple.co\/1FMerJA\">'attendees welcome' video<\/a> with some of the others in line! In the end, it wouldn't matter so much that I waited ten hours. I had the awesome honor of being pulled from the line and seated <a href=\"https:\/\/twitter.com\/thejohnwickham\/status\/607944778026618880\">near the front of the audience<\/a>. They keynote was exciting to say the least: Tim Cook and Craig Federighi presented the latest form Cupertino. Joining them on stage was Drake and The Weekend (who debuted a new song in a private concert for us).<br><br>I hadn't slept nor eaten in 24 hours, and maybe that's why the day seemed to take a turn after the keynote. After meeting people from all over the world who were very easy to get along with, I had several interactions with others that have left a poor impression on me. Some of us have a certain arrogance or selfishness that feels like they're trying to ruin the experience for everyone else. I'm sure they're talented people &mdash; after all, Apple did invite them, too &mdash; but I've decided to make some connections elsewhere.<br><br>As always, stay tuned for more conference updates in the <span style=\"background: #621fce; color: white; font-weight: 700; font-size: 15px; padding: 3px 7px 3px 7px; -webkit-border-radius: 3px; user-select: none; -webkit-user-select: none;\">WWDC15<\/span> tag."
		},
		{
			"ID": "14",
			"title": "Watch: WWDC Day 3",
			"date": "Tues. 9 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping day three of WWDC 2015",
			"content": "My day began at 9:00 AM today. I took a short walk from the hotel to Moscone West and joined two "
		},
		{
			"ID": "15",
			"title": "Stick to the Schedule: WWDC Day 4",
			"date": "Wed. 10 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping day four of WWDC 2015",
			"content": "San Francisco is starting to feel more like home. Even the one&ndash;legged homeless beggers and crazy yelling crack addicts are starting to feel like family. I'm enjoying the walk to Moscone in the morning, the conversations with other developers in sessions, and the connections with other students in the lounge. I think I like having a routine in my days, and when my day doesn't follow the schedule, I get uncomfortable. Today felt like one of those days.<br><br>Well in advance, I had picked out all of the sessions and labs that I wanted to go to. My day was going to be full of learning, and I was excited. But, as happens often in our lives, logistics interfered with my plans. <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#13\">Like I said<\/a>, everything at WWDC is a line &mdash; a long, long line. Until now, it hasn't bothered me so much; I'm okay to wait in line, as long as I get my turn. But now I'm realizing that waiting in line doesn't guarantee anything at WWDC. So, I waited in line for the session about Designing Interfaces in Interface Builder, but had to watch from the overflow seating. Overflow seating is nestled in the corner of the enormous Framework Labs room, making it hard to understand what's going on.<br><br>The next session, Designing for Future Hardware, was pretty interesting. The presentation was given by two of Apple's team members who specialize in prototypes and mockups. They play with Apple's hardware as it's being designed and find out what could be done better. What a sweet job. I can't detail everything they talk about in the session, as per Apple's NDA agreement, but I can say that they hit some of the highlights about making a useful prototype design and testing it in the wild. That session stuck with me. Apple definitly puts a ton of effort and care into design, and they really consider how users will react to different ideas.<br><br>I left that session feeling pretty inspired, and headed downstairs to work with an engineer from the Apple Watch software (called <code>watchOS<\/code>) team. I've been having a problem where the <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#7\">Prototask<\/a> app refuses to show on my Watch. Surely, I thought, this will be simple enough, and Apple's engineers will solve it with a few keystrokes. When I explained my dilemma, the engineer sort of shrugged and made a few guesses. Among them was to try and restore the software on my Watch. It's not a fun process &mdash; it takes a while, and it's sort of a hassle &mdash; but I'm a developer, and that's what we do, I guess. About an hour later, the problem persisted, and I was really frustrated.<br><br>My frustration convinced me, somehow, that I ought to make some major changes to the Prototask source code, without making any sort of backup, or version control. After several minutes of this, Prototask would no longer install on my iPhone, let alone my Watch. This meant I would have nothing to bring to my next lab, and sort of brought my day to an unexpected end, and on a bad note."
		},
		{
			"ID": "16",
			"title": "Bash Day: WWDC Day 5",
			"date": "Thurs. 11 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping day five of WWDC 2015",
			"content": "As usual, I walked down Fourth Street to Moscone and joined others in the scholarship lounge for a breakfast smoothie. Apple has done a really good job of keeping their developers stocked with snacks and drinks, with a notable <a href=\"https:\/\/source.android.com\/source\/build-numbers.html\">absence of Lollipops, Kit&ndash;Kats, jelly beans, and ice cream sandwiches<\/a>.<br><br>I planned on a networking lab to get some questions answered about the <code>NSURLSession<\/code> framework, but after waiting around for almost an hour, I abandoned it. That's what got me thinking: Apple, your conference is too big. I love that there are people here from all around the world, and in some ways, the more the merrier. But when all 5,000 of us want to work with the same small group of engineers and designers, most of us end up being disappointed. Not to mention the huge ordeal that is they keynote line. Next year, I'm sleeping. It looks a little more glamorous online anyway.<br><br>The key event today was the WWDC Bash. At the end of the week of each WWDC, Apple books a popular band or artist to play a private concert for the developers in Yerba Buena Gardens. Scholarship winners are invited to a separate event at the Metreon balcony overlooking to concert, which was pretty cool. This year, we got to hear <a href=\"https:\/\/itunes.apple.com\/us\/artist\/walk-the-moon\/id451783136\">WALK THE MOON<\/a>, pretty sweet. Several of Apple's celebrity executives also made an appearance, as they have throughout the week. And, as with every time, a huge crowd of students flocks to them and grovle for a photo or autograph. All week this has made me kind of uncomfortable. I know these executives, and I definitely respect and admire them, but they're being treated like a commodity. I want to meet them for real &mdash; shake their hand, introduce myself, and have a real conversation. I understand they're popular, important people&hellip; but they're people nonetheless.<br><img src=\"Contents\/17-Bash.jpeg\" style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 50%;\"><span class=\"caption\">WWDC Bash from the Metreon balcony<\/span><br>For me, best part of the Bash was talking with an engineer who was there. Where hundreds of others crowded an elevator to take a blurry photo of Craig Federighi, I introduced myself to an engineer named Nicolo, who works on creating Apple's developer tools software. It was one of the most rewarding conversations I had all week. She was very personable, engaging, and most of all passionate. I asked about what it's like to work at Apple, what her days look like, and how her past shaped her current position. She was very willing to talk about her job, which seems to be mostly meetings and coordination of her team. I got to hear about the internals of Apple, too. She noted that no one at Apple is there reluctantly. The people are passionate about their work, every day. They don't settle, and don't stop until they're satisfied. When I asked about her past, she told me that she's been with Apple for about 15 years (that's older than some of the scholarship winners here). What's really cool is that she was one of the very first WWDC scholarship winners when the scholarship program first started. She won a scholarship in all four of her college years and ended up at Apple. What I heard is that I have a chance at coming back to WWDC next year. Talking with Nicole was really valuable, much more than a photo with an executive. It's a good picture of the type of networking that happens at dub&ndash;dub.<br><br>The conference wraps up tomorrow, so ther'll be one more <span style=\"background: #621fce; color: white; font-weight: 700; font-size: 15px; padding: 3px 7px 3px 7px; -webkit-border-radius: 3px; user-select: none; -webkit-user-select: none;\">WWDC15<\/span> recap post. Stay tuned&hellip;."
		},
		{
			"ID": "17",
			"title": "@end: WWDC Day 6",
			"date": "Fri. 12 June 2015",
			"tags": "WWDC15,APPLE",
			"headline": "Recapping the sixth and final day of WWDC",
			"content": "This week has felt so long and so short at the same time. I'm not quite ready to leave San Francisco and Moscone West behind, but WWDC is definitely an exhausting event. I'm really hoping that I get to come back next year, but in the mean time, I've got lots of work to do.<br><br>Primarily, I'm going to start going to hackathons. A hackathon is a 36&ndash;hour event in which a small team is challanged to create the best software product they can. Until now, I was very (very) reluctant to be part of a hackathon. Maybe it's because of the stigma of a 3&ndash;day computer programming party. But after <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#17\">speaking with an Apple engineer<\/a> yesterday, it seems like it's way more cool than that. Beyond just programming, she told me that teams are in desperate need of designers, and good presenters. It seems like many teams have good ideas, and can impliment the functionality well, but their products don't score well with the judges because they don't work well in the real world, and they aren't presented in an enticing way. I think I could really do well at both of those things. Not to mention that I haven't had very much experience working in teams, so a small&ndash;scale project like a hackathon could be a really good place to experience it.<br><br>I also would not have had the confidence for a hackathon had it not been for another conversation that I had today. While waiting for Session 803, Designing With Animation (which was the most fascination session all week), I sat next to someone I recognized. He was another student scholarship winner who hung around with a group that always seemed to have something going on (honestly, they're the showoff group). We made some smalltalk, and he said her recognized me from the <a href=\"http:\/\/wjwickham.com\/Blog\/dotWrite.html#10\">20 Under 20 promotion<\/a>. That was really cool, because he actually seemed impressed by it. He asked about PitchFork and how I made it, and in talking about it, I realized something about myself. <b>I'm much more of a designer than a technical&ndash;minded person<\/b>. More specifically, I'm good at taking someone else's idea and applying very meaningful details that truely enhance the experience. It seemed like he agreed with me, and said that I \"act like a designer\" because I'm \"much more extroverted\" than others. I've never thought of myself as an extrovert, but hearing that others perceive me that way makes me think that I've found some kind of balance between passion for what I do and personal skills that I'll need to apply it. That was a great way to enter the session, and end the week at WWDC.<br><br>Looking back on the whole week, it was an unbelievable experience. I have genuinely dreamed of coming, and I think it lives up to every bit of hype it receives, even if it's in the unexpected ways. There's no doubt that the thing's I've done this week, and the connections I've made, are going to shape my future. With that, I'm about to close my MacBook and walk out of Moscone West for the last time this year. Until next year, dub&ndash;dub.<br><img src=\"Contents\/18-Map.png\" style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 50%;\"\/>"
		},
		{
			"ID": "18",
			"title": "New Backdrop Effects in WebKit & Safari 9",
			"date": "Sun. 12 July 2015",
			"tags": "WEB DESIGN",
			"headline": "Leveraging the new feature in WebKit",
			"content": "When Apple introduced iOS 7 and the new design of iOS, one of the most compelling and attractive features of the new interface was the blurred backdrop effect that appeared across the system. In iOS 8, developers were able to leverage the same beautiful effects in their apps using the <code>UIVisualEffectView<\/code> class. That made it much more convenient to impliment designs that fit in well with the system &mdash; but it also allowed us to render these effects much more efficiently than we could by mimicking the effect manually.<br><br><img src=\"Contents\/19-iOS.png\" style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 35%;\"\/><span class=\"caption\">Translucent elements introduced in iOS 7<\/span><br><br>With iOS 9 and OS X El Capitan, WebKit has introduced a similar opportunity to extend the system's design language into the web. A new <code>-webkit-backdrop-filter:<\/code> CSS property allows one to apply any CSS filter to the background of an element &ndash; including the <code>blur()<\/code> filter. The <code>blur()<\/code> filter has long been available, but it was never very useful for creating backdrop effects. You'd have to duplicate the section of the content that you wanted to blur, create another element an style it &mdash; that's a lot of work, not to mention how inefficient it is.<br><br>Using <code>blur()<\/code> on this new background filter property creates an effect that feels right at home on iOS and OS X. Similar to the introduction of <code>UIVisualEffectView<\/code>, this new CSS property allows us to leverage powerful system graphics capabilities to render this effect seamlessly, and with far less overhead than implimenting it manually.<br><br>This new property can also be used with all of the existing CSS filters, such as <code>grayscale()<\/code>, though the <code>blur()<\/code> filter really fits in well on iOS and OS X. Both of these platforms now support the <code>@supports<\/code> CSS query, so we can apply the new backdrop filter property only on browsers that support it. I've implemented the new effect on the navigation bars of <a href=\"http:\/\/wjwickham.com\/\">my website<\/a>, as well as this blog.<img src=\"Contents\/19-Homepage.png\" style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 50%;\"\/><span class=\"caption\">Check out that translucency!<\/span>"
		},
		{
			"ID": "19",
			"title": "Onboarding is On–Boring",
			"date": "Mon. 11 August 2015",
			"tags": "iOS",
			"headline": "Introducing users to your app the right way",
			"content": "Installing a new app can be like buying a new car. You probably put some amount of research into it, considered how it looks, and how it performs – and how well it's going to meet your needs. When you get behind the wheel of your new ride for the first time, it may not be immediately obvious how you do all the things you're used to, but in any well–designed car, it isn't too hard to figure out where the windshield wipers are.<br><br>Similarly, when you install a new app, you have some vague idea of how it works, how it looks, and how you're going to use it to fit your needs. But every app, like every car, is designed a little differently to fit its functionality. Sometimes this means that there's a little bit of a learning curve for an app. To combat this, many apps present a process when opened for the first time that teaches users how to use it — this process is known as <i>onboarding<\/i>. Onboarding isn't necessarily a bad thing, but taking time to teach users about using an app can take away from the overall experience. This begs a couple of questions: <b>How much onboarding is too much, and what's the best way to handle the onboarding process?<\/b><br><br><span style=\"font-weight: bold; font-size: 21px;\">HOW MUCH IS TOO MUCH?<\/span><br><br>Oddly enough, the answer to this question has less to do with how much onboarding you do, and more to do with how well your app is designed. If it's really intuitive, and makes sense, you won't need to teach your users very much – they'll figure it out naturally. The key is only teaching users as much as they need to get them out of the dark; if they're going to be totally lost without onboarding, it's okay to orient them a little. As long as they're headed in the right direction, and your design is natural, users will enjoy learning and using your app easily.<br><br><span style=\"font-weight: bold; font-size: 21px;\">THE BEST ONBOARDING EXPERIENCE<\/span><br><br>If you've determined that your app really does need an onboarding experience, there are several ways to make sure it truely benefits your users' experience.<br><br><div style=\"width: 80%; margin-left: 10%;\"><b>1. Make it quick.<\/b> Remember that new car you just bought: imageine if you had to read the entire owner's manual before you could hit the road. User's don't want to to read a novel about using your app, they want to actually use it! This goes double for apps that have that intuitive, natural design, because user's would already be familiar with most of the information you're presenting.<br><br><b>2. Guide by example.<\/b> Often, explaining how to use your app with words is much less effective than an interactive demonstration. This is an area that I'm proud of my app, PitchFork. The app changes the speed and pitch of music by dragging a bar up and down on screen. This is a totally new interface – there really aren't any comparable controls in other apps, so it was necessary to show users how it works. Rather than typing out a paragraph that explains how to drag it, PitchFork's onboarding experience presents the drag bar with the phrase 'slide to continue.' As you slide, the text changes to reinforce the action. When the user drags it all the way up, the interface transitions to the main view, and the user totally understands the custom control.<br><br><b>3. Let users skip it.<\/b> Sometimes users don't need the lesson. Maybe they used your app on a friend's device and already understand it. Don't force them to sit through the lesson all over again.<\/div><br><br>Above all, remember that your onboarding process is the very first impression your app has on your users. As always, put yourself in their shoes; consider how the experience feels, and don't let onboarding be an afterthought."
		},
		{
			"ID": "20",
			"title": "In With the Old",
			"date": "Thurs. September 10, 2015",
			"headline": "When to defy precedent in design",
			"content": "There's a word that's used frequently when we talk about technology: <i>innovation<\/i>. Something that's innovative is supposed to be entirely new, completly alien, and totally revolutionary. But this has created a dangerous mindset that the only products that matter are the ones that fit those criteria. We love things that disrupt the status quo.<br><br>And most of the time, that's fantastic. Innovation can drive us forward and make us better. But the innovation&ndash;obsessed mindset can also work against us; we become fixated on creating something that hasn't been done before, convinced that new is always better. Sometimes the best way is the old way, and just because something is 'new' doesn't necessarily mean it's any better.<br><br>This isn't really a new concept, but it's a big deal in design, especially applicable in software. When we create software, it's made for a specific platform &ndash; be it iOS, Android, OS X, etc. Every platform has its own <i>conventions<\/i> &ndash; patterns of design that remain consistent throughout the platform. The reason for the consistency is immediate familarity. One of the most common examples of a convention is an envelope used to represent Email. It's familiar, recognizable, universal, and it translates real&ndash;world experiences to software use. So could you imagine if we started using envelopes to represent something different? Suddenly all of your real&ndash;world experiences would mean nothing in your software.<br><br><img style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 20%;\" src=\"Contents\/21-Icon.png\"\/><br><span class=\"caption\">Breaking convention can feel really unnatural&hellip;<\/span><br><br>All that this really means is that just becuase something is new or different, doesn't necessarliy mean it's any better. A platform's conventions exist for a reason, and like them or not, it's what your users know. Adhering to conventions makes your product intuitive for users &ndash; they can use it naturally without too much thought.<br><br>There are, however, instances in which it's necessary to create something totally new. For times when there is no platform precedent, and no other sensible system solution exists, creating an entirely new experience benefits your users by giving them the best way to manipulate their content. The trick, then, is knowing when to follow precedent and convention, and when to innovate and create something new. Apple's <a href=\"https:\/\/itun.es\/us\/pyfv0\">Human Interface Guidelines<\/a> put this really well:<br><br><div style=\"width: 75%; left: 0; right: 0; margin: auto auto; margin-top: 50px; margin-bottom: 50px; font-family: 'HelveticaNeue', 'Helvetica', 'Arial', sans-serif; color: #e06841; font-style: italic; font-weight: 500; text-align: center; font-size: 21pt;\">&ldquo;Be prepared to defy precedent, question assumptions, and let a focus on content and functionality motivate every design decision.&rdquo;<\/div><br><span style=\"color: gray; font-style: italic;\">Excerpt From: Apple Inc. &ldquo;iOS Human Interface Guidelines.&rdquo; iBooks.<\/span>"
		},
		{
			"ID": "21",
			"title": "Apple Music on Android",
			"date": "Thurs. 12 November 2015",
			"tags": "APPLE",
			"headline": "A case study in designing around precedent",
			"content": "<span style=\"font-style: italic; color: gray;\">The <a href=\"https:\/\/wjwickham.com\/Blog\/dotWrite.html\/#21\">previous post<\/a> is a good introduction to some ideas in this post.<\/span><br><br>Back in June, Apple made some waves by announcing that their new music service, Apple Music, would be available on Android. iOS and Google's Android systems have some pretty fundamental differences in design, so immediately, designers everywhere started to wonder what Apple Music would look like on when it arrived in the Google Play Store. Would it look like an iOS app, or an experience truly designed to fit in on Android?<br><br>Now, Apple's first official Android app has arrived, and we have an answer. As many (including myself) had hoped, Apple Music on Android isn't just an iOS app that works on Android: it's an honest to God Android app. Aligning with Android's Material Design pattern, the app boats bigger text, card views, and the vague misleading iconography that feels right at home on Android. All of these things are in service of creating an experience that feels familiar to its users. Even Apple knows that Android users don't want to use an iOS app, they want an experience that will be natural, familiar, and consistant with the other apps they use every day.<br><br><img src=\"Contents\/22-Music.png\" style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 35%;\"\/><span class=\"caption\">Apple Music on Android<\/span><br><br>That's not to say that Apple Music's Android counterpart is a totally foreign experience. Much of the iOS experience was carried over, like the album stacks pictured above. And it makes sense; if the system hasn't set any precedent for that kind of interface, you're free to explore a new kind of experience.<br><br>All in all, I'm glad to see Apple continuing its commitment to designing clear and consistent experience, regardless of platform. <div style=\"width: 75%; left: 0; right: 0; margin: auto auto; margin-top: 50px; margin-bottom: 30px; font-family: 'HelveticaNeue', 'Helvetica', 'Arial', sans-serif; color: #e06841; font-style: italic; font-weight: 500; text-align: center; font-size: 21pt;\">&ldquo;If you’ve used it on iOS, you’ve used it for Android.<br>We wanted it to be for everyone.&rdquo;<br><br><span style=\"color: gray; font-size: 18px;\">&mdash; Eddie Cue<\/span><\/div>"
		},
		{
			"ID": "22",
			"title": "An Open Letter to KeepSafe, Inc.",
			"date": "Sun. 20 March 2016",
			"tags": "IOS",
			"headline": "Thoughts on KeepSafe's recent redesign",
			"content": "One of my favorite apps, KeepSafe, recently released a major update to their iOS app. KeepSafe is an app that lets you lock up important files behind an additional passcode, and it really is useful. Until recently, the design of the KeepSafe app was terrific; it was beautiful, original, and felt right at home on iOS. But this week, they updated their app and pretty much abandoned everything that made me love their product. It's become infuriating to use, so I wrote to the company on Twitter to share my thoughts. Since KeepSafe neglected to respond entirely, I want to put my message out there so it doesn't go to waste: <div style=\"width: 80%; margin: auto auto; margin-top: 60px; margin-bottom: 60px; padding: 60px; background: #EEF6F9; border-radius: 5px; -webkit-border-radius: 5px; -moz-border-radius:5px;\">Hi KeepSafe, I hope this message reaches you all. I've been a user for quite a while, and your app was one of my favorites – until the release of version 6. <br><br>Version 6 appears to have abandoned the principles of design that iOS users love and expect. Instead, the design of your app is now almost entirely defined by what appears to be Android's Material Design. I'm incredibly disappointed that an app I loved has made such a poor decision for the experience of its users. <br><br>To your design \/ development team: I strongly urge you to consider what it means to design a product for a specific platform, and  what kind of experience is made when you blatantly ignore the conventions and precedents that have long been established.<\/div>I do want to clarify one thing: I actually like a lot of Material Design. This has nothing to do with the fact that KeepSafe is using those design principals, it's because they're using Material Design <i>in an iOS app<\/i>. I've written before <a href=\"https:\/\/wjwickham.com\/Blog\/dotWrite.html#21\">about designing for a platform<\/a> and explained how following convention benefits users; that's the real problem I have with this.<br><br>It's pretty clear that I was on a war path when I wrote it, but it's because it really got under my skin. I'm doubtful that KeepSafe will respond, or that many people will read this message here, but I'm putting it out there nonetheless.<br><br><span style=\"font-weight: 700; padding: 5px; background: #E06841; -webkit-border-radius: 3px; -moz-border-radius: 3px; color: white; font-size: 15px;\">UPDATE<\/span> Just after posting this, I tweeted a link and mentioned @keepsafe. Almost instantly, their support account, @KeepSafeHelp, replied with a copy&ndash;paste response:<br><br><img style=\"display: block; margin-left: auto; margin-right: auto; margin-top: 30px; width: 320px;\" src=\"Contents\/22-tweet.png\"\/><br><span class=\"caption\">How not to run customer support&hellip;<\/span><br><br>Essentially, \"We didn't listen to you at all, but we're sure that our latest crap update will fix all your problems :).\" So today we learned two lessons about user experience."
		}
	]
}